<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest installer (as specified by INSTALLER_TYPE) for Sassafras AllSight/LabSight/KeySight.

INSTALLER_TYPE can have a value of client or admin. You may create an override and set this value yourself,
or you can use the SassafrasClient, SassafrasAdmin, and SassafrasServer recipes respectively as a convenience.

REVISION is the major version without a decimal, for example:
7.7: 77
7.8: 78
7.9: 79
</string>
	<key>Identifier</key>
	<string>com.github.jazzace.download.sassafrasallsight</string>
	<key>Input</key>
	<dict>
		<key>INSTALLER_TYPE</key>
		<string>admin</string>
		<key>REVISION</key>
		<string></string>		
		<key>NAME</key>
		<string>AllSight</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.4</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://www.sassafras.com/links/ksp-%INSTALLER_TYPE%-%REVISION%-latest.pkg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Sassafras Software, Inc. (7Z2KSDFMVY)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%pathname%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
